## Plan Result (shared-snowplow-consumer-cdk-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807465371)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 6 to add, 2 to change, 6 to destroy.</code></pre>

* Create
  * aws_sns_topic_subscription.CollectionEvents-sns-subscription
  * aws_sns_topic_subscription.SearchEvents-sns-subscription
  * aws_sns_topic_subscription.ShareEvents-sns-subscription
  * aws_sns_topic_subscription.ShareableListEvents-sns-subscription
  * aws_sns_topic_subscription.ShareableListItemEvents-sns-subscription
  * aws_sns_topic_subscription.UserEvents-sns-subscription
* Update
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy
  * aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy
* Delete
  * aws_sns_topic_subscription.CollectionEventTopic-sns-subscription
  * aws_sns_topic_subscription.SearchApiEventTopic-sns-subscription
  * aws_sns_topic_subscription.ShareableListEventTopic-sns-subscription
  * aws_sns_topic_subscription.ShareableListItemEventTopic-sns-subscription
  * aws_sns_topic_subscription.SharesApiEventTopic-sns-subscription
  * aws_sns_topic_subscription.UserEventTopic-sns-subscription



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.CollectionEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.CollectionEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "CollectionEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:918ce650-bbc0-4387-9ec6-e1d2d7b022a1" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:918ce650-bbc0-4387-9ec6-e1d2d7b022a1" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.CollectionEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "CollectionEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents"
    }

  # aws_sns_topic_subscription.SearchApiEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.SearchApiEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "SearchApiEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic:53b988e3-46d0-4197-9511-a97ddadee323" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic:53b988e3-46d0-4197-9511-a97ddadee323" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.SearchEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "SearchEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchEvents"
    }

  # aws_sns_topic_subscription.ShareEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ShareEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareEvents"
    }

  # aws_sns_topic_subscription.ShareableListEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.ShareableListEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "ShareableListEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic:882bb679-9adb-43a7-8c14-0a4e0fc37321" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic:882bb679-9adb-43a7-8c14-0a4e0fc37321" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.ShareableListEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ShareableListEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEvents"
    }

  # aws_sns_topic_subscription.ShareableListItemEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.ShareableListItemEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "ShareableListItemEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic:000b6051-9a41-4565-871b-4b33adf5d7ea" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic:000b6051-9a41-4565-871b-4b33adf5d7ea" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.ShareableListItemEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "ShareableListItemEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEvents"
    }

  # aws_sns_topic_subscription.SharesApiEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.SharesApiEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "SharesApiEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic:d72ee6be-8adf-4799-b992-6710545a4883" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic:d72ee6be-8adf-4799-b992-6710545a4883" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.UserEventTopic-sns-subscription will be destroyed
  # (because aws_sns_topic_subscription.UserEventTopic-sns-subscription is not in configuration)
  - resource "aws_sns_topic_subscription" "UserEventTopic-sns-subscription" {
      - arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f1cb7068-6943-4a28-bea3-5417eb5c3988" -> null
      - confirmation_timeout_in_minutes = 1 -> null
      - confirmation_was_authenticated  = true -> null
      - endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue" -> null
      - endpoint_auto_confirms          = false -> null
      - id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f1cb7068-6943-4a28-bea3-5417eb5c3988" -> null
      - owner_id                        = "996905175585" -> null
      - pending_confirmation            = false -> null
      - protocol                        = "sqs" -> null
      - raw_message_delivery            = false -> null
      - redrive_policy                  = jsonencode(
            {
              - deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        ) -> null
      - topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> null
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.UserEvents-sns-subscription will be created
  + resource "aws_sns_topic_subscription" "UserEvents-sns-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + redrive_policy                  = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:us-east-1:996905175585:SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
            }
        )
      + topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SNS-Topics-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "shared-snowplow-consumer-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnLike = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents",
                                    "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SharesApiEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchApiEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-SearchEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 2 to change, 6 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":950,"Program":"tfcmt","SHA1":"30995768cfe3eb840fc69e2735e0ffbba670a40e","Target":"shared-snowplow-consumer-cdk-production","Vars":{},"WorkflowName":"Shared Snowplow Consumer"} -->